var des ={
	inches : "<b>Definition</b>: Use of the inch can be traced back as far as the 7th century. The first explicit Definition we could find of its length was after 1066 when it was defined as the length of three barleycorns. This was not a satisfactory reference as barleycorn lengths vary naturally. The British Standards Institute defined the inch as 25.4mm in 1930 in the document \"Metric Units in Engineering: Going SI\". In March 1932 the American Standards Association were asked to rule on whether to adopt the same value (at the time the American inch was 1/.03937 mm which approximated to 25.400051 mm). Because the values were so close, and because Britain has already settled on that value, the ASA adopted this value on March 13, 1933.",
	meters: "<b>Definition</b>: 1 m is equivalent to 1.0936 yards, or 39.370 inches.Since 1983, the metre has been officially defined as the length of the path travelled by light in a vacuum during a time interval of 1/299,792,458 of a second.",
	feet: "<b>Description</b>: The foot is a unit of length used in the imperial and U.S. customary measurement systems, representing 1/3 of a yard, and is subdivided into twelve inches.",
	yard: "A unit of length equal to 3 feet; defined as 91.44 centimeters; originally taken to be the average length of a stride",
	millimeters: "<b>Definition</b>: The millimetre is a unit of length in the metric system, equivalent to one thousandth of a metre (the SI base unit of length).One meter was defined in 1983 by the 17th conference of weights and measures as “the length of the path travelled by light in vacuum during a time interval of 1/299 792 458 of a second” and the millimetre by <b>Definition</b> is derived as being 1/1000th of that value",
	miles: "A unit of length equal to 1760 yards",
	kilometers: "<b>Definition</b>: The kilometre is unit of length in the metric system equivalent to one thousand metres.1Km is equivalent to 0.6214 miles.",
	centimeters: "<b>Definition</b>: The centimetre is a unit of length in the metric system, equal to one-hundredth of a metre. 1cm is equivalent to 0.39370 inches.",
	sqinches : "A unit of area equal to one inch by one inch square.",
	sqmillimeters : "A measurement of area equal to one millimeter length by one millimeter width.",
	sqfeet : "<b>Description</b>: The square foot is a unit of area used in the imperial and U.S. customary measurement systems.A square measurement is the two-dimensional derivative of a linear measure, so a square foot is defined as the area of a square with sides 1 ft in length.",
	sqmeters : "A measurement of area equal to one meter length by one meter width.",
	sqyard : "A unit of area equal to one yard by one yard square.",
	acres : "A unit of area (4840 square yards) used in English-speaking countries",
	hectares : "a unit of surface, or land, measure equal to 100 ares, or 10,000 square meters: equivalent to 2.471 acres.<br> <b>Abbreviation</b> : ha",
	sqmiles  : "A measurement of area equal to one mile length by one mile width making an area of 640 acres",
	sqkilometers : "A measurement of area equal to one kilometer length by one kilometer width.",
	fluidounces : "Cooking measurement.",
	milliliters  : "a unit of capacity equal to one thousandth of a liter, and equivalent to 0.033815 fluid ounce, or 0.061025 cubic inch.<br> <b>Abbreviation</b> : ml",
	gallons : "There are several different kinds of Gallons available- us liquid, us dry and uk. Please select a more specific option.",
	liters : "<br>a unit of capacity redefined in 1964 by a reduction of 28 parts in a million to be exactly equal to one cubic decimeter. It is equivalent to 1.0567 U.S. liquid quarts and is equal to the volume of one kilogram of distilled water at 4°C. <br> <b>Abbreviation</b> : l",
	cubicfeet : "<b>Description</b>: The cubic foot is a unit of volume used in the imperial and U.S. customary measurement systems.The cubic foot can be used to describe a volume of a given material, or the capacity of a container to hold such a material.",
	cubicmeters : "A metric unit of volume, commonly used in expressing concentrations of a chemical in a volume of air. One cubic meter equals 35.3 cubic feet or 1.3 cubic yards. One cubic meter also equals 1000 liters or one million cubic centimeters.",
	cubicyards : "A unit of volume (as for sand or gravel)",
	ounces : "A unit of weight equal to one sixteenth of a pound or 16 drams or 28.349 grams",
	grams : "A metric unit of weight equal to one thousandth of a kilogram",
	pounds : "<b>Description</b>: The pound is a measurement of mass used in the imperial system, and is accepted on a day-to-day basis as a unit of weight (the gravitational force acting on any given object).",
	kilograms : "<b>Description</b>:The kilogram is the base unit of mass in the International (SI) System of Units, and is accepted on a day-to-day basis as a unit of weight (the gravitational force acting on any given object).<br><b>The kilogram is almost exactly equal to the mass of one litre of water.</b>",
	shorttons : "United States measurement also known as a short ton that equals 2,000 pounds",
	ton : "A unit of weight equal to 1,000 kilograms, or approximately 2,204.6 pounds.",
	Fahrenheit  : "<b>Definition</b>:Fahrenheit is a thermodynamic temperature scale, where the freezing point of water is 32 degrees Fahrenheit (°F) and the boiling point 212°F (at standard atmospheric pressure). This puts the boiling and freezing points of water exactly 180 degrees apart. Therefore, a degree on the Fahrenheit scale is 1/180 of the interval between the freezing point and the boiling point of water. Absolute zero is defined as -459.67°F. <br>A temperature difference of 1°F is the equivalent of a temperature difference 0.556°C. ",
	Celsius : "<b>Definition</b>: Although initially defined by the freezing point of water (and later the melting point of ice), the Celsius scale is now officially a derived scale, defined in relation to the Kelvin temperature scale. Zero on the Celsius scale (0°C) is now defined as the equivalent to 273.15K, with a temperature difference of 1 deg C equivalent to a difference of 1K, meaning the unit size in each scale is the same. This means that 100°C, previously defined as the boiling point of water, is now defined as the equivalent to 373.15K.<br><br>The Celsius scale is an interval system but not a ratio system, meaning it follows a relative scale but not an absolute scale. This can be seen because the temperature interval between 20°C and 30°C is the same as between 30°C and 40°C, but 40°C does not have twice the air heat energy of 20°C. A temperature difference of 1 deg C is the equivalent of a temperature difference 1.8°F",
	DegreeKelvin : "The basic unit of temperature in the International System of Units (SI), formally defined to be approximately 1/273 of the triple point of water.<br> <b>Abbreviation</b> : K"

};
